Revit 2024 API
ViewSchedule.CreateRevisionSchedule Method
 Creates a revision schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ViewSchedule CreateRevisionSchedule(
	Document document
)
Visual Basic
Public Shared Function CreateRevisionSchedule ( _
	document As Document _
) As ViewSchedule
Visual C++
public:
static ViewSchedule^ CreateRevisionSchedule(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The titleblock family document to which the new schedule will be added.
Return Value
 The newly created schedule.
Remarks
 Revision schedules are added to titleblock families and become visible as part of titleblocks on sheets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a titleblock family.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace